openfoam_les_model/0.orig/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  splitCyclic                           |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [ 0 1 -1 0 0 0 0 ];

inlet 
{
    type fixedValue;
    value uniform (1, 0, 0);
}

internalField   nonuniform List<vector> 
60000
(
(0.0107927 -2.64614e-05 0.00214946)
(0.0107939 -3.50395e-05 0.0018715)
(0.010668 -2.59457e-05 0.0018284)
(0.010506 -2.30178e-05 0.00187392)
(0.0102247 -2.2066e-05 0.00177587)
(0.00955156 -1.34048e-05 0.0014899)
(0.0083707 -2.63435e-06 0.00120244)
(0.00701494 -5.03113e-06 0.00106753)
...
)
;

boundaryField
{
    bottomWall
    {
        type            fixedValue;
        value           uniform ( 0 0 0 );
    }
    topWall
    {
        type            fixedValue;
        value           uniform ( 0 0 0 );
    }
    sides1_half0
    {
        type            cyclic;
    }
    sides2_half0
    {
        type            cyclic;
    }
    inout1_half0
    {
        type            cyclic;
    }
    inout2_half0
    {
        type            cyclic;
    }
    sides2_half1
    {
        type            cyclic;
    }
    sides1_half1
    {
        type            cyclic;
    }
    inout1_half1
    {
        type            cyclic;
    }
    inout2_half1
    {
        type            cyclic;
    }
}


// ************************************************************************* //
